## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:27" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:27" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 27 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "00bc4cd9ef7d908e382f47c1206f76c4-6" -> "ceb06b1b5a2c6467d99b66c5529dd553"
      ~ id                     = "graphql.dc448572876ddfd7912a8c6203fa928e.zip" -> (known after apply)
      ~ key                    = "graphql.dc448572876ddfd7912a8c6203fa928e.zip" -> "graphql.ceb06b1b5a2c6467d99b66c5529dd553.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "dc448572876ddfd7912a8c6203fa928e" -> "ceb06b1b5a2c6467d99b66c5529dd553"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "fvDKt8lBh5ixPvGUVCPfLI33QW106xdz" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a8af18f2ff56b06c11fa1727d9a20536" -> "41a3af38e35b06ca9ea52ce4d4e54e43"
        id                     = "dist/200.html"
      ~ source_hash            = "a8af18f2ff56b06c11fa1727d9a20536" -> "41a3af38e35b06ca9ea52ce4d4e54e43"
        tags                   = {}
      ~ version_id             = "TdDJoX9zvgv_OdoFU6z_b22TXyjAJ8C1" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "5fc5387a89f304e1313f6a034aa2f182" -> "ca924fe5053092dd78132d19da64093e"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "5fc5387a89f304e1313f6a034aa2f182" -> "ca924fe5053092dd78132d19da64093e"
        tags                   = {}
      ~ version_id             = "irlnf9L5bLEnz6sqxkizGAAYgCkYHV.0" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "24500fad75e9089591b4d4a1b3e5984b" -> "469ddb0c570f8aeba9afe9c8ad7009de"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "24500fad75e9089591b4d4a1b3e5984b" -> "469ddb0c570f8aeba9afe9c8ad7009de"
        tags                   = {}
      ~ version_id             = "h903Qj.Nq_NGRQB5xSK6vjuf6RKJyaYY" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a8af18f2ff56b06c11fa1727d9a20536" -> "41a3af38e35b06ca9ea52ce4d4e54e43"
        id                     = "dist/index.html"
      ~ source_hash            = "a8af18f2ff56b06c11fa1727d9a20536" -> "41a3af38e35b06ca9ea52ce4d4e54e43"
        tags                   = {}
      ~ version_id             = "oozzt6_kLzsn_JOhwhxfKhOQhCRkhQnq" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/ForbiddenPage.cc985d61.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "1075062437fd06eaca2f7193cdc26779"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/ForbiddenPage.cc985d61.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ForbiddenPage.cc985d61.chunk.js"
+       source_hash            = "1075062437fd06eaca2f7193cdc26779"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/ForbiddenPage.cc985d61.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "21962cae04ec342211f86142d0f0e5b2"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/ForbiddenPage.cc985d61.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ForbiddenPage.cc985d61.chunk.js.LICENSE.txt"
+       source_hash            = "21962cae04ec342211f86142d0f0e5b2"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationEditOrganizationPage.4e3a30de.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f4318de1ca1d8469a0dc37ed3db674bd"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationEditOrganizationPage.4e3a30de.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationEditOrganizationPage.4e3a30de.chunk.js"
+       source_hash            = "f4318de1ca1d8469a0dc37ed3db674bd"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationEditOrganizationPage.4e3a30de.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "9a56729e133a208ed282910883d0a78d"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationEditOrganizationPage.4e3a30de.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationEditOrganizationPage.4e3a30de.chunk.js.LICENSE.txt"
+       source_hash            = "9a56729e133a208ed282910883d0a78d"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationEditOrganizationPage.54afd531.chunk.js"] will be destroyed
  # (because key ["static/js/OrganizationEditOrganizationPage.54afd531.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "ed744eeae4e8a781269a95b38a33a4f2" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationEditOrganizationPage.54afd531.chunk.js" -> null
-       key                    = "dist/static/js/OrganizationEditOrganizationPage.54afd531.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationEditOrganizationPage.54afd531.chunk.js" -> null
-       source_hash            = "ed744eeae4e8a781269a95b38a33a4f2" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "R.mSoUehSgfNJ716befS_wxcToH9CUSS" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationEditOrganizationPage.54afd531.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/OrganizationEditOrganizationPage.54afd531.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "8a0b38f7baa36897e72772f56e87a38f" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationEditOrganizationPage.54afd531.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/OrganizationEditOrganizationPage.54afd531.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationEditOrganizationPage.54afd531.chunk.js.LICENSE.txt" -> null
-       source_hash            = "8a0b38f7baa36897e72772f56e87a38f" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "tnSz8kGJaBLjZaV.kzEXkb7bFki_DjCm" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationNewOrganizationPage.936b4492.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cfb86056c8701f8f00aedd457e6562d4"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationNewOrganizationPage.936b4492.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationNewOrganizationPage.936b4492.chunk.js"
+       source_hash            = "cfb86056c8701f8f00aedd457e6562d4"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationNewOrganizationPage.936b4492.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "1fe4b797c311fc06fda04e671fb6a084"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationNewOrganizationPage.936b4492.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationNewOrganizationPage.936b4492.chunk.js.LICENSE.txt"
+       source_hash            = "1fe4b797c311fc06fda04e671fb6a084"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js"] will be destroyed
  # (because key ["static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "7418fcbef4a3521e97e10eb4b11a1bcb" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js" -> null
-       key                    = "dist/static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js" -> null
-       source_hash            = "7418fcbef4a3521e97e10eb4b11a1bcb" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "LPFeY9iycuOQA0kokcGN8639CUX0JcHn" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "2a1e1a838077413f775b16b619b654f8" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationNewOrganizationPage.dbb40664.chunk.js.LICENSE.txt" -> null
-       source_hash            = "2a1e1a838077413f775b16b619b654f8" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "x0S.0rI15FzXxSQuAZPMTSjY0NHdb7bb" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.34a84a88.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "e8d0ef097e64f468801ad85611ee3e78"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.34a84a88.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.34a84a88.js"
+       source_hash            = "e8d0ef097e64f468801ad85611ee3e78"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.34a84a88.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "abc9254dbdda54138b5077f883e4643c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.34a84a88.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.34a84a88.js.LICENSE.txt"
+       source_hash            = "abc9254dbdda54138b5077f883e4643c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7d3866da.js"] will be destroyed
  # (because key ["static/js/app.7d3866da.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "39bfbe991d0665d6af8084bff5d38134" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.7d3866da.js" -> null
-       key                    = "dist/static/js/app.7d3866da.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7d3866da.js" -> null
-       source_hash            = "39bfbe991d0665d6af8084bff5d38134" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "0NGCvp.zpBaTmYXIwCrqXyYVk1OiGr7V" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7d3866da.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.7d3866da.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "22534f5b586cb736e9cdf4c0742c3fd1" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.7d3866da.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.7d3866da.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7d3866da.js.LICENSE.txt" -> null
-       source_hash            = "22534f5b586cb736e9cdf4c0742c3fd1" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "UcIxB5.tyIyXnli4AJoN3dW2pkId_StW" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.2c819207.js"] will be destroyed
  # (because key ["static/js/runtime-app.2c819207.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "b15d7caba841d187868cf52eba1e24e9" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.2c819207.js" -> null
-       key                    = "dist/static/js/runtime-app.2c819207.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.2c819207.js" -> null
-       source_hash            = "b15d7caba841d187868cf52eba1e24e9" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "7BnUu63r8s93MVKyq48xOSgyKwLwSeVy" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.ae9b0a56.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "a67b8d9905002cbb9b4664c7e0781292"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.ae9b0a56.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.ae9b0a56.js"
+       source_hash            = "a67b8d9905002cbb9b4664c7e0781292"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2023-12-23T23:55:56.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:43" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:43/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.dc448572876ddfd7912a8c6203fa928e.zip" -> "graphql.ceb06b1b5a2c6467d99b66c5529dd553.zip"
        tags                           = {}
      ~ version                        = "43" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "1927dbe1b2c80f801880ae9aa0fd18cd61aa4195" -> "71ce4df0844a5af7ac05bc6f2be538265bf18543"
              ~ "DD_TAGS"                            = "git.commit.sha:1927dbe1b2c80f801880ae9aa0fd18cd61aa4195,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:71ce4df0844a5af7ac05bc6f2be538265bf18543,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "1927dbe1b2c80f801880ae9aa0fd18cd61aa4195" -> "71ce4df0844a5af7ac05bc6f2be538265bf18543"
                # (15 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "43" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 12 to add, 6 to change, 10 to destroy.
```

</details>

*Pusher: @Vikariusu, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7359790659)*